#+title: literate debugging

Debugging with literate tools to take rich notes along the way.

A challenge is it adds some overhead, so you have to make very ergonomic tooling to overcome that overhead.

It's very nice to look back at and can significantly speed up similar tasks however.

* TODO a simple example

#+name: 6b188f9b-951c-4b37-92a4-a93f1927489f
#+begin_src sh
  exec 2>&1
  if [ -f "/tmp/somerandomfile" ]; then
      echo "$FILE exists."
  else 
      echo "$FILE does not exist."
  fi
  :
#+end_src

#+RESULTS: 6b188f9b-951c-4b37-92a4-a93f1927489f
: does not exist.

#+name: 8e9d5abe-062a-4631-9367-be16b7a8f352
#+begin_src sh 
touch /tmp/somerandomfile
#+end_src

#+RESULTS: 8e9d5abe-062a-4631-9367-be16b7a8f352

#+call: 6b188f9b-951c-4b37-92a4-a93f1927489f()

#+RESULTS:
: exists.



* TODO an example using noweb

* TODO realistic examples

** description 

It'd be cool to showcase this by picking some random repo from [[https://github.com/explore][Github explore]] and debug an issue they have. Even better (maybe?) if it's a language I either haven't used or haven't used in a while.

* TODO navigation can feel tricky/overwhelming at first

** An example

*** You are sharing an analysis' conclusion like:

#+begin_quote
All active users were deleted
#+end_quote
*** because

#+name: CmJ8kRPtpRkjpo5EKYMZqw
#+begin_src sql
select * from users where legacy_active = 1;
#+end_src

*** and someone says:

#+begin_quote
No, we migrated the legacy `active_field` to active finally.
#+end_quote

*** Then you have some options

**** create a new snippet and retype the query

#+begin_example
db1ProdRO<TAB>
#+end_example

**** copy/paste the entire previous block

***** typically you'll be in or below that block

***** meaning you would do
#+name: jgdv9Es5yi5PEnXPZhtw2w
#+begin_example
?beg RET <TAB> yy C-o p
#+end_example

***** pro: no extra setup

***** con: mental overhead

***** might take time to find the right previous block


**** TODO use [[file:20210417170439-org_babel_snippet_history_like_command_line_history.org][org babel snippet history like command line history]] 

***** =C-p= and the old query shows up:

#+begin_src sql
select * from users where legacy_active = 1;
#+end_src

***** note that you land end of line in my currently imagined functionality

***** modify it with

#+name: Enj2jEysAxKSGpuZEBaPrA
#+begin_example
/leg RET df_ C-c C-c
#+end_example

***** and you get 

#+begin_src sql
select * from users where active = 1;
#+end_src

